Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shiji__shiji-003-annals-of-yin__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 殷契，母曰簡狄，有娀氏之女，為帝嚳次妃。
en: Qi of Yin's mother was Jian Di, who was one of the daughters of Yousong and the secondary wife of Emperor Ku.

source: 三人行浴，見玄鳥墮其卵，簡狄取吞之，因孕生契。
en: She was going with her two sisters to bathe, when she saw a dark bird drop its egg.

source: 契長而佐禹治水有功。
en: Jian Di picked it up, and swallowed it, and thus being with child gave birth to Qi.

source: 帝舜乃命契曰：
en: When Qi grew up, he was successful in assisting Yu to control the flood, and the Emperor Shun, directing Qi, said:

source: 「百姓不親，五品不訓，汝為司徒而敬敷五教，五教在寬。
en: The people are wanting in affection for one another, and do not observe the five orders of relationship.

source: 」封于商，賜姓子氏。
en: You, as Minister of Instruction, should reverently inculcate the lessons of duty belonging to those five orders, but do so with gentleness.

source: 契興於唐、虞、大禹之際，功業著於百姓，百姓以平。
en: He held in fief the principality of Shang, and was given the Surname Of Zi.

source: 契卒，子昭明立。
en: Qi flourished in the reigns of Yao, Shun, and the great Yu.

source: 昭明卒，子相土立。
en: His services were manifest to the people, who were accordingly at peace.

source: 相土卒，子昌若立。
en: Qi died, and His Son Zhaoming succeeded him.

source: 昌若卒，子曹圉立。
en: Zhaoming died, and His Son Xiangtu succeeded him.

source: 曹圉卒，子冥立。
en: Xiangtu died, and his Son Chang Ruo succeeded him.

source: 冥卒，子振立。
en: Chang Ruo died, and his Son Cao Yu succeeded him.

source: 振卒，子微立。
en: Cao Yu died, and His Son Ming succeeded him.

source: 微卒，子報丁立。
en: Ming died, and His Son Zhen succeeded him.

source: 報丁卒，子報乙立。
en: Zhen died, and His Son Wei succeeded him.

source: 報乙卒，子報丙立。
en: Wei died, and His Son Baoding succeeded him.
